uhnp/src/InformationRegisters/ПроектыСПЗПозиции/ПроектыСПЗПозиции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроектыСПЗПозиции</name>
  <resources>
    <name>Количество</name>
    <comment>Количество потребности в базовой единице измерения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <comment>В валюте учета закупок</comment>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияЗаказчик</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодПотребности</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПотребностей</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияПотребностей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаСтруктуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиПланированияСтруктуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаИсточника</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаПланирования</name>
    <type>
      <types>CatalogRef.КлючиАналитикПланирования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдПроекта</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ПроектыСПЗПозиции/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы
 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоТоварнаяКатегория = ТипЗнч(Запись.АналитикаНоменклатуры.Номенклатура) = Тип("СправочникСсылка.ТоварныеКатегории");
	
	Элементы.Количество.Видимость = НЕ ЭтоТоварнаяКатегория;
	Элементы.Цена.Видимость = НЕ ЭтоТоварнаяКатегория;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	Если НЕ ЭтоТоварнаяКатегория Тогда
		Запись.Сумма = Запись.Количество * Запись.Цена;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
